cases/Case01/0/H2O
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    catalyticWall
    {
        type            	groovyBC;
	fractionExpression 	"0";		// Neumann condition
	value           	uniform 0;	// Only af the first iteration

	valueFraction   uniform 0;
        refValue        uniform 1;
        refGradient     uniform 1;        
        
	gradientExpression "catBC";
	variables       "alfa=1.;MW=18.015000;nu=1;kappa=1.e-2;r=kappa*H2;R=nu*r;catBC=MW*alfa/Dmix_H2O/rho*R;";
        
	evaluateDuringConstruction 0;
	timelines       ();
        lookuptables    ();
    }
    fixedWall
    {
        type            zeroGradient;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    outlet
    {
	type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
}


// ************************************************************************* //
