cases/Case01/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0.05;
        smoother        GaussSeidel;
        cacheAgglomeration off;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-06;
        relTol          0.01;
    }

    h
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.001;
    }

    Yi
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          1e-4;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    rhoMin          rhoMin [ 1 -3 0 0 0 ] 0.01;
    rhoMax          rhoMax [ 1 -3 0 0 0 ] 2.;

    residualControl
    {
	// species
        default         1e-5;

	// fluid dynamics fields
        p               1e-2;
        U               1e-4;
        h               1e-3;
	e               1e-3;
    }
}

relaxationFactors
{
    fields
    {
        p               0.2;
        rho             0.2;
    }
    equations
    {
	// species
        default         0.7;
	H2         	0.7;
	O2         	0.7;
	H2O         	0.7;
	AR         	0.7;

	// fluid dynamics fields
        U               0.7;
    }
}


// ************************************************************************* //
